Autodesk.Revit.DB.PDFParameterDictionary.SetValue(System.String,Autodesk.Revit.DB.Transform)
Set a transform property.
key:
Key to the property.
value:
Value to the property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.PDFParameterDictionary.SetValue(System.String,System.String)
Set a string property.
key:
Key to the property.
value:
Value to the property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.PDFParameterDictionary.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.PDFParameterDictionary.#ctor
Initialize an empty dictionary.
Since:
2022

Autodesk.Revit.DB.PDFParameterDictionary
Dictionary in PDF that map string keys to a various types of values.
Since:
2022